RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z1287/include/MKV10Z1287_extension.h
/*******************************************************************************
 * MMDVSQ_RES - Result Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_RES - Result Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the result of the divide or square root
 * calculation. It is updated by the MMDVSQ hardware at the completion of the
 * calculation. When a square root operation is performed (on an unsigned 32-bit number),
 * the result is limited to a 16-bit value with RES[31:16] = 0x0000. Any memory
 * access (read or write) of the RES register while the module is busy during a
 * calculation causes the access to be stalled (using wait states) until the
 * calculation completes and the new result written into the register.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_RES register
 */
/*@{*/
#define MMDVSQ_RD_RES(base)      (MMDVSQ_RES_REG(base))
#define MMDVSQ_WR_RES(base, value) (MMDVSQ_RES_REG(base) = (value))
#define MMDVSQ_RMW_RES(base, mask, value) (MMDVSQ_WR_RES(base, (MMDVSQ_RD_RES(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) |  (value)))
#define MMDVSQ_CLR_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) & ~(value)))
#define MMDVSQ_TOG_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMDVSQ_RCND - Radicand Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_RCND - Radicand Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The write-only radicand register is loaded with the input "square" number. A
 * memory write to the radicand register initiates a square root calculation.
 * While the MMDVSQ module is busy performing a square root calculation, any memory
 * write access to the RCND register causes the write access to be stalled (using
 * wait states) until the square root calculation finishes. Any attempted read
 * of the radicand register terminates with an error.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_RCND register
 */
/*@{*/
#define MMDVSQ_RD_RCND(base)     (MMDVSQ_RCND_REG(base))
#define MMDVSQ_WR_RCND(base, value) (MMDVSQ_RCND_REG(base) = (value))
#define MMDVSQ_RMW_RCND(base, mask, value) (MMDVSQ_WR_RCND(base, (MMDVSQ_RD_RCND(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) |  (value)))
#define MMDVSQ_CLR_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) & ~(value)))
#define MMDVSQ_TOG_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) ^  (value)))
/*@}*/

/*
 * MKV10Z1287 MTB
 *
 * Micro Trace Buffer
 *
 * Registers defined in this header file:
 * - MTB_POSITION - MTB Position Register
 * - MTB_MASTER - MTB Master Register
 * - MTB_FLOW - MTB Flow Register
 * - MTB_BASE - MTB Base Register
 * - MTB_MODECTRL - Integration Mode Control Register
 * - MTB_TAGSET - Claim TAG Set Register
 * - MTB_TAGCLEAR - Claim TAG Clear Register
 * - MTB_LOCKACCESS - Lock Access Register
 * - MTB_LOCKSTAT - Lock Status Register
 * - MTB_AUTHSTAT - Authentication Status Register
 * - MTB_DEVICEARCH - Device Architecture Register
 * - MTB_DEVICECFG - Device Configuration Register
 * - MTB_DEVICETYPID - Device Type Identifier Register
 * - MTB_PERIPHID - Peripheral ID Register
 * - MTB_COMPID - Component ID Register
 */

#define MTB_INSTANCE_COUNT (1U) /*!< Number of instances of the MTB module. */
#define MTB_IDX (0U) /*!< Instance number for MTB. */

/*******************************************************************************
 * MTB_POSITION - MTB Position Register
 ******************************************************************************/

/*!
 * @brief MTB_POSITION - MTB Position Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MTB_POSITION register contains the Trace Write Address Pointer and Wrap
 * fields. This register can be modified by the explicit programming model writes.
 * It is also automatically updated by the MTB hardware when trace packets are
 * being recorded. The base address of the system RAM in the memory map dictates
 * special consideration for the placement of the MTB. Consider the following
 * guidelines: For the standard configuration where the size of the MTB is <= 25% of
 * the total RAM capacity, it is recommended the MTB be based at the address
 * defined by the MTB_BASE register. The read-only MTB_BASE register is defined by
 * the expression (0x2000_0000 - (RAM_Size/4)). For this configuration, the
 * MTB_POSITION register is initialized to MTB_BASE & 0x0000_7FF8. If the size of the
 * MTB is more than 25% but less than or equal to 50% of the total RAM capacity, it
 * is recommended the MTB be based at address 0x2000_0000. In this
 * configuration, the MTB_POSITION register is initialized to (0x2000_0000 & 0x0000_7FF8) =
 * 0x0000_00000. Following these two suggested placements provides a full-featured
 * circular memory buffer containing program trace packets. In the unlikely event
 * an even larger trace buffer is required, a write-once capacity of 75% of the
 * total RAM capacity can be based at address 0x2000_0000. The MTB_POSITION
 * register is initialized to (0x2000_0000 & 0x0000_7FF8) = 0x0000_0000. However, this
 * configuration cannot support operation as a circular queue and instead
 * requires the use of the MTB_FLOW[WATERMARK] capability to automatically disable
 * tracing or halting the processor as the number of packet writes approach the
 * buffer capacity. See the MTB_FLOW register description for more details.
 */
/*!
 * @name Constants and macros for entire MTB_POSITION register
 */
/*@{*/
#define MTB_RD_POSITION(base)    (MTB_POSITION_REG(base))
#define MTB_WR_POSITION(base, value) (MTB_POSITION_REG(base) = (value))
#define MTB_RMW_POSITION(base, mask, value) (MTB_WR_POSITION(base, (MTB_RD_POSITION(base) & ~(mask)) | (value)))
#define MTB_SET_POSITION(base, value) (MTB_WR_POSITION(base, MTB_RD_POSITION(base) |  (value)))
#define MTB_CLR_POSITION(base, value) (MTB_WR_POSITION(base, MTB_RD_POSITION(base) & ~(value)))
#define MTB_TOG_POSITION(base, value) (MTB_WR_POSITION(base, MTB_RD_POSITION(base) ^  (value)))
/*@}*/

