RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z1287/include/MKV10Z1287_extension.h
/*! @brief Set the FTM0TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG0SRC_MASK, SIM_SOPT4_FTM0TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG0SRC_SHIFT), SIM_SOPT4_FTM0TRG0SRC_SHIFT, SIM_SOPT4_FTM0TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG1SRC[8] (RW)
 *
 * Selects the source of FTM0 hardware trigger 1.
 *
 * Values:
 * - 0b0 - PDB0 channel 1 trigger drives FTM0 hardware trigger 1
 * - 0b1 - FTM2 channel match drives FTM0 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0TRG1SRC field. */
#define SIM_RD_SOPT4_FTM0TRG1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0TRG1SRC_MASK) >> SIM_SOPT4_FTM0TRG1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM0TRG1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0TRG1SRC_SHIFT, SIM_SOPT4_FTM0TRG1SRC_WIDTH))

/*! @brief Set the FTM0TRG1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG1SRC_MASK, SIM_SOPT4_FTM0TRG1SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG1SRC_SHIFT), SIM_SOPT4_FTM0TRG1SRC_SHIFT, SIM_SOPT4_FTM0TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0TRG2SRC[9] (RW)
 *
 * Selects the source of FTM0 hardware trigger 2.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM0 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM0 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0TRG2SRC field. */
#define SIM_RD_SOPT4_FTM0TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0TRG2SRC_MASK) >> SIM_SOPT4_FTM0TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM0TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0TRG2SRC_SHIFT, SIM_SOPT4_FTM0TRG2SRC_WIDTH))

/*! @brief Set the FTM0TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM0TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0TRG2SRC_MASK, SIM_SOPT4_FTM0TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM0TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0TRG2SRC_SHIFT), SIM_SOPT4_FTM0TRG2SRC_SHIFT, SIM_SOPT4_FTM0TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG0SRC[10] (RW)
 *
 * Selects the source of FTM1 hardware trigger 0.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM1 hardware trigger 0
 * - 0b1 - FTM0 channel match drives FTM1 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1TRG0SRC field. */
#define SIM_RD_SOPT4_FTM1TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1TRG0SRC_MASK) >> SIM_SOPT4_FTM1TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1TRG0SRC_SHIFT, SIM_SOPT4_FTM1TRG0SRC_WIDTH))

/*! @brief Set the FTM1TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1TRG0SRC_MASK, SIM_SOPT4_FTM1TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM1TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1TRG0SRC_SHIFT), SIM_SOPT4_FTM1TRG0SRC_SHIFT, SIM_SOPT4_FTM1TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG1SRC[11] (RW)
 *
 * Selects the source of FTM1 hardware trigger 1.
 *
 * Values:
 * - 0b0 - PDB0 channel 1 trigger drives FTM1 hardware trigger 1
 * - 0b1 - FTM2 channel match drives FTM1 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1TRG1SRC field. */
#define SIM_RD_SOPT4_FTM1TRG1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1TRG1SRC_MASK) >> SIM_SOPT4_FTM1TRG1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1TRG1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1TRG1SRC_SHIFT, SIM_SOPT4_FTM1TRG1SRC_WIDTH))

/*! @brief Set the FTM1TRG1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1TRG1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1TRG1SRC_MASK, SIM_SOPT4_FTM1TRG1SRC(value)))
#define SIM_BWR_SOPT4_FTM1TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1TRG1SRC_SHIFT), SIM_SOPT4_FTM1TRG1SRC_SHIFT, SIM_SOPT4_FTM1TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1TRG2SRC[12] (RW)
 *
 * Selects the source of FTM1 hardware trigger 2.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM1 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM1 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1TRG2SRC field. */
#define SIM_RD_SOPT4_FTM1TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1TRG2SRC_MASK) >> SIM_SOPT4_FTM1TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1TRG2SRC_SHIFT, SIM_SOPT4_FTM1TRG2SRC_WIDTH))

/*! @brief Set the FTM1TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1TRG2SRC_MASK, SIM_SOPT4_FTM1TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM1TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1TRG2SRC_SHIFT), SIM_SOPT4_FTM1TRG2SRC_SHIFT, SIM_SOPT4_FTM1TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG0SRC[13] (RW)
 *
 * Selects the source of FTM2 hardware trigger 0.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM2 hardware trigger 0
 * - 0b1 - FTM0 channel match drives FTM2 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG0SRC field. */
#define SIM_RD_SOPT4_FTM2TRG0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2TRG0SRC_MASK) >> SIM_SOPT4_FTM2TRG0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2TRG0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2TRG0SRC_SHIFT, SIM_SOPT4_FTM2TRG0SRC_WIDTH))

/*! @brief Set the FTM2TRG0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2TRG0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2TRG0SRC_MASK, SIM_SOPT4_FTM2TRG0SRC(value)))
#define SIM_BWR_SOPT4_FTM2TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2TRG0SRC_SHIFT), SIM_SOPT4_FTM2TRG0SRC_SHIFT, SIM_SOPT4_FTM2TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG1SRC[14] (RW)
 *
 * Selects the source of FTM2 hardware trigger 1.
 *
 * Values:
 * - 0b0 - PDB0 output trigger 1 drives FTM2 hardware trigger 1
 * - 0b1 - FTM1 channel match drives FTM2 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG1SRC field. */
#define SIM_RD_SOPT4_FTM2TRG1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2TRG1SRC_MASK) >> SIM_SOPT4_FTM2TRG1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2TRG1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2TRG1SRC_SHIFT, SIM_SOPT4_FTM2TRG1SRC_WIDTH))

/*! @brief Set the FTM2TRG1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2TRG1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2TRG1SRC_MASK, SIM_SOPT4_FTM2TRG1SRC(value)))
#define SIM_BWR_SOPT4_FTM2TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2TRG1SRC_SHIFT), SIM_SOPT4_FTM2TRG1SRC_SHIFT, SIM_SOPT4_FTM2TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2TRG2SRC[15] (RW)
 *
 * Selects the source of FTM2 hardware trigger 2.
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM2 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM2 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2TRG2SRC field. */
#define SIM_RD_SOPT4_FTM2TRG2SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2TRG2SRC_MASK) >> SIM_SOPT4_FTM2TRG2SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2TRG2SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2TRG2SRC_SHIFT, SIM_SOPT4_FTM2TRG2SRC_WIDTH))

/*! @brief Set the FTM2TRG2SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2TRG2SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2TRG2SRC_MASK, SIM_SOPT4_FTM2TRG2SRC(value)))
#define SIM_BWR_SOPT4_FTM2TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2TRG2SRC_SHIFT), SIM_SOPT4_FTM2TRG2SRC_SHIFT, SIM_SOPT4_FTM2TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1CH0SRC[19:18] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 0b00 - FTM1_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1CH0SRC field. */
#define SIM_RD_SOPT4_FTM1CH0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1CH0SRC_MASK) >> SIM_SOPT4_FTM1CH0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1CH0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1CH0SRC_SHIFT, SIM_SOPT4_FTM1CH0SRC_WIDTH))

/*! @brief Set the FTM1CH0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1CH0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1CH0SRC_MASK, SIM_SOPT4_FTM1CH0SRC(value)))
#define SIM_BWR_SOPT4_FTM1CH0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM1CH0SRC_SHIFT), SIM_SOPT4_FTM1CH0SRC_SHIFT, SIM_SOPT4_FTM1CH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2CH0SRC[21:20] (RW)
 *
 * Selects the source for FTM2 channel 0 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 0b00 - FTM2_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2CH0SRC field. */
#define SIM_RD_SOPT4_FTM2CH0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2CH0SRC_MASK) >> SIM_SOPT4_FTM2CH0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2CH0SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2CH0SRC_SHIFT, SIM_SOPT4_FTM2CH0SRC_WIDTH))

/*! @brief Set the FTM2CH0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2CH0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2CH0SRC_MASK, SIM_SOPT4_FTM2CH0SRC(value)))
#define SIM_BWR_SOPT4_FTM2CH0SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2CH0SRC_SHIFT), SIM_SOPT4_FTM2CH0SRC_SHIFT, SIM_SOPT4_FTM2CH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2CH1SRC[22] (RW)
 *
 * Selects the source for FTM2 channel 1 input capture. When the FTM is not in
 * Input Capture mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2_CH1 pin is fed to FTM2 CH1
 * - 0b1 - FTM2_CH1 pin XOR FTM2_CH0 pin XOR FTM1_CH1 pin is fed to FTM2 CH1 If
 *     this field is set, then the three input pins feed FTM2 channel 1 input
 *     capture. In this case, FTM1 channel 1 cannot be used for input capture of
 *     FTM1, as it has no pin. FTM1 channel1 can be used for Output Compare mode of
 *     FTM1, though without an output.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2CH1SRC field. */
#define SIM_RD_SOPT4_FTM2CH1SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2CH1SRC_MASK) >> SIM_SOPT4_FTM2CH1SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2CH1SRC(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2CH1SRC_SHIFT, SIM_SOPT4_FTM2CH1SRC_WIDTH))

/*! @brief Set the FTM2CH1SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2CH1SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2CH1SRC_MASK, SIM_SOPT4_FTM2CH1SRC(value)))
#define SIM_BWR_SOPT4_FTM2CH1SRC(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM2CH1SRC_SHIFT), SIM_SOPT4_FTM2CH1SRC_SHIFT, SIM_SOPT4_FTM2CH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0CLKSEL[25:24] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM0 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM0 external clock driven by FTM_CLKIN0 pin
 * - 0b01 - FTM0 external clock driven by FTM_CLKIN1 pin
 * - 0b10 - FTM0 external clock driven by FTM_CLKIN2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0CLKSEL field. */
#define SIM_RD_SOPT4_FTM0CLKSEL(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0CLKSEL_MASK) >> SIM_SOPT4_FTM0CLKSEL_SHIFT)
#define SIM_BRD_SOPT4_FTM0CLKSEL(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0CLKSEL_SHIFT, SIM_SOPT4_FTM0CLKSEL_WIDTH))

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define SIM_WR_SOPT4_FTM0CLKSEL(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0CLKSEL_MASK, SIM_SOPT4_FTM0CLKSEL(value)))
#define SIM_BWR_SOPT4_FTM0CLKSEL(base, value) (BME_BFI32(&SIM_SOPT4_REG(base), ((uint32_t)(value) << SIM_SOPT4_FTM0CLKSEL_SHIFT), SIM_SOPT4_FTM0CLKSEL_SHIFT, SIM_SOPT4_FTM0CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1CLKSEL[27:26] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM1 external clock driven by FTM_CLKIN0 pin
 * - 0b01 - FTM1 external clock driven by FTM_CLKIN1 pin
 * - 0b10 - FTM1 external clock driven by FTM_CLKIN2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1CLKSEL field. */
#define SIM_RD_SOPT4_FTM1CLKSEL(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1CLKSEL_MASK) >> SIM_SOPT4_FTM1CLKSEL_SHIFT)
#define SIM_BRD_SOPT4_FTM1CLKSEL(base) (BME_UBFX32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1CLKSEL_SHIFT, SIM_SOPT4_FTM1CLKSEL_WIDTH))

